In [77]:
import requests

import pandas as pd

from bs4 import BeautifulSoup

import sqlite3

import numpy as np

import plotly.express as px

import sqlite3


#df = ...

sqlite_connection = sqlite3.connect('db_name.db')

df.to_sql('table_name', con=sqlite_connection, index=False, if_exists='replace')

In [78]:
URL = 'https://practicum-content.s3.us-west-1.amazonaws.com/data-analyst-eng/moved_chicago_weather_2017.html'

In [79]:
req = requests.get(URL)

In [80]:
soup = BeautifulSoup(req.text, 'lxml')

In [81]:
table = soup.find('table', attrs={"id": "weather_records"})

In [82]:
headers = [header.text for header in table.find_all('th')]

In [83]:
rows = []
for row in table.find_all('tr'):
    cells = row.find_all('td')
    if len(cells) > 0:
        rows.append([cell.text for cell in cells])

weather_records = pd.DataFrame(rows, columns=headers)

In [84]:
weather_records = pd.DataFrame(rows, columns=headers)

weather_records.head()

         Date and time Temperature       Description
0  2017-11-01 00:00:00     276.150     broken clouds
1  2017-11-01 01:00:00     275.700  scattered clouds
2  2017-11-01 02:00:00     275.610   overcast clouds
3  2017-11-01 03:00:00     275.350     broken clouds
4  2017-11-01 04:00:00     275.240     broken clouds

In [85]:
weather_records = weather_records.rename(columns={'Date and time' : 'date_and_time', 'Temperature': 'temperature', 'Description': 'description'})

weather_records.head()

         date_and_time temperature       description
0  2017-11-01 00:00:00     276.150     broken clouds
1  2017-11-01 01:00:00     275.700  scattered clouds
2  2017-11-01 02:00:00     275.610   overcast clouds
3  2017-11-01 03:00:00     275.350     broken clouds
4  2017-11-01 04:00:00     275.240     broken clouds

In [86]:
weather_records['date_and_time'] = pd.to_datetime(weather_records['date_and_time'], format='%Y-%m-%d %H:%M:%S')

import sqlite3



sqlite_connection = sqlite3.connect('db_name.db')

df.to_sql('table_name', con=sqlite_connection, index=False, if_exists='replace')

sqlite_connection = sqlite3.connect('db_weather.db')

weather_records.to_sql('weather_records', con=sqlite_connection, index=False, if_exists='replace')

pd.read_sql("""

SELECT *
FROM population 
LIMIT 10

""", sqlite_connection)

Example:
broken_clouds = pd.read_sql(""" SELECT * FROM weather_records WHERE description='broken clouds'""", sqlite_connection)

In [87]:
weather_records.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 697 entries, 0 to 696
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date_and_time  697 non-null    datetime64[ns]
 1   temperature    697 non-null    object
 2   description    697 non-null    object
dtypes: datetime64[ns](1), object(2)
memory usage: 16.5+ KB

In [88]:
weather_records.isna().sum()

date_and_time    0
temperature      0
description      0
dtype: int64

In [89]:
weather_records.duplicated().sum()

0

In [90]:
weather_records.shape

(697, 3)

In [123]:
trips = pd.read_csv('moved_project_sql_result_01.csv')

trips.head()

                      company_name  trips_amount
0                        Flash Cab         19558
1        Taxi Affiliation Services         11422
2                 Medallion Leasin         10367
3                       Yellow Cab          9888
4  Taxi Affiliation Service Yellow          9299

Find the number of taxi rides for each taxi company for November 15-16, 2017. Name the resulting field trips_amount and print it along with the company_name field. Sort the results by the trips_amount field in descending order.

In [93]:
weather_records.head()

        date_and_time temperature       description
0 2017-11-01 00:00:00     276.150     broken clouds
1 2017-11-01 01:00:00     275.700  scattered clouds
2 2017-11-01 02:00:00     275.610   overcast clouds
3 2017-11-01 03:00:00     275.350     broken clouds
4 2017-11-01 04:00:00     275.240     broken clouds

sqlite_connection_2 = sqlite3.connect('db_company.db')

company_df.to_sql('company', con=sqlite_connection, index=False, if_exists='replace')

In [94]:
#sqlite_connection_2.execute("ATTACH DATABASE db_weather.db AS db_weather.db")

In [95]:
cabs.duplicated().sum()

0

In [96]:
cabs.isna().sum()

company_name    0
trips_amount    0
dtype: int64

In [97]:
cabs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_name  64 non-null     object
 1   trips_amount  64 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB

Find the number of taxi rides for each taxi company for November 15-16, 2017. Name the resulting field trips_amount and print it along with the company_name field. Sort the results by the trips_amount field in descending order.

SELECT 
    COUNT(company_name) AS trips_amount,
    company_name AS company_name
WHERE 
    CAST(date) AS date IS BETWEEN November 15, 2017 AND November 16 2017
GROUP BY
    trips_amount
ORDER BY
    DESC;

In [98]:
cabs.head()

                      company_name  trips_amount
0                        Flash Cab         19558
1        Taxi Affiliation Services         11422
2                 Medallion Leasin         10367
3                       Yellow Cab          9888
4  Taxi Affiliation Service Yellow          9299

Example:
broken_clouds = pd.read_sql(""" SELECT * FROM weather_records WHERE description='broken clouds'""", sqlite_connection)

Find the number of rides for every taxi company whose name contains the words "Yellow" or "Blue" for November 1-7, 2017. Name the resulting variable trips_amount. Group the results by the company_name field.

SELECT 
    COUNT(trips_amount) AS trips_amount
WHERE Date and time as date IS BETWEEN NOVEMBER 1, 2017 AND NOVEMBER 17, 2017 
AND name LIKE '%yellow%' OR '%blue%'
GROUP BY
    company_name;

In [100]:
cabs['trips_amount'] = cabs['trips_amount'].astype(int)

In November 2017, the most popular taxi companies were Flash Cab and Taxi Affiliation Services. Find the number of rides for these two companies and name the resulting variable trips_amount. Join the rides for all other companies in the group "Other." Group the data by taxi company names. Name the field with taxi company names company. Sort the result in descending order by trips_amount.

SELECT 
    COUNT(trips_amount) AS trips_amount,
WHERE 
    date = NOV 2017 AND name LIKE '%Flash Cab%' OR '%Taxi Affilation Services%
GROUP BY 
    company_name
ORDER BY
    trips_amount DESC;

In [124]:
dropoff_location = pd.read_csv('moved_project_sql_result_04.csv')

dropoff_location

   dropoff_location_name  average_trips
0                   Loop   10727.466667
1            River North    9523.666667
2          Streeterville    6664.666667
3              West Loop    5163.666667
4                 O'Hare    2546.900000
..                   ...            ...
89       Mount Greenwood       3.137931
90             Hegewisch       3.117647
91              Burnside       2.333333
92             East Side       1.961538
93             Riverdale       1.800000

[94 rows x 2 columns]

In [128]:
weather_conditions = pd.read_csv('moved_project_sql_result_07 (2).csv')

In [130]:
weather_conditions.head()

              start_ts weather_conditions  duration_seconds
0  2017-11-25 16:00:00               Good            2410.0
1  2017-11-25 14:00:00               Good            1920.0
2  2017-11-25 12:00:00               Good            1543.0
3  2017-11-04 10:00:00               Good            2512.0
4  2017-11-11 07:00:00               Good            1440.0

Hypothesis Question
"The average duration of rides from the Loop to O'Hare International Airport changes on rainy Saturdays."
Filter bad.
1 population is good and 1 population is bad and you test the hypothesis.
calculated the variance, calculate standard deviation.

In [108]:
weather_records['start_ts'] = pd.to_datetime(neighborhoods['start_ts'], format='%Y-%m-%d %H:%M:%S')

In [ ]:
c_sum = cabs.groupby('company_name')['trips_amount'].sum()
c_sum = c_sum.reset_index().rename(columns={'trips_amount': 'trips_amount_sum'})
c_sum = c_sum.sort_values(by='trips_amount_sum', ascending=False)

c_sum.head(10)

In [ ]:
company = 'Flash Cab', 'Taxi Affiliation Services', 'Medallion Leasin', 'Yellow Cab', 'Taxi Affiliation Service Yellow', 'Chicago Carriage Cab Corp', 'City Service', 'Sun Taxi', 'Star North Management LLC', 'Blue Ribbon Taxi Association Inc.'

c_trip = c_sum['company_name'].isin(company)

c_trips = c_sum[c_trip]

c_trips.head()

In [ ]:
company_bar = px.bar(c_trips, x='company_name', y='trips_amount_sum', color='company_name', labels={'company_name': 'Company Name', 'trips_amount_sum': 'Trips Amount Sum'}, title='Number of Rides Per Taxi Company')
company_bar.show()

# identify the top 10 neighborhoods in terms of drop-offs

In [ ]:
top_n_sum = trips.groupby('dropoff_location_name')['average_trips'].sum()
top_n_sum = top_n_sum.reset_index().rename(columns={'average_trips': 'average_trips_sum'})
top_n_sum = top_n_sum.sort_values(by='average_trips_sum', ascending=False)
top_n_sum.head(10)

In [ ]:
location = 'Loop', 'River North', 'Streeterville', 'West Loop', "O'Hare", 'Lake View', 'Grant Park', 'Museum Campus', 'Gold Coast', 'Sheffield & DePaul'

top_10 = top_n_sum['dropoff_location_name'].isin(location)

top_10_df = top_n_sum[top_10]

top_10_df.head(10)

In [ ]:
top_10_bar = px.bar(top_10_df, x='dropoff_location_name', y='average_trips_sum', labels={'dropoff_location_name': 'Dropoff Location Name', 'average_trips_sum': 'Average Trips Sum'},title='Top 10 Neighborhoods in Terms of Dropoffs', color='dropoff_location_name')

top_10_bar.show()

In [ ]:
top_n_sum['dropoff_location_name'].unique()